Tekla.Structures.Analysis.AnalysisLoadGroup.LoadGroupTypeEnum
The types of load groups.

Tekla.Structures.Analysis.AnalysisLoadGroup.LoadGroupTypeEnum.NOT_DEFINED
The load group has not been defined.

Tekla.Structures.Analysis.AnalysisLoadGroup.LoadGroupTypeEnum.LOADM_DEFAULT_GROUP
The default load group.

Tekla.Structures.Analysis.AnalysisLoadGroup.LoadGroupTypeEnum.LOADM_SELF_WEIGHT_EC
The Eurocode self weight type.

Tekla.Structures.Analysis.AnalysisLoadGroup.LoadGroupTypeEnum.LOADM_PERMANENT_LOAD_EC
The Eurocode permanent load type.

Tekla.Structures.Analysis.AnalysisLoadGroup.LoadGroupTypeEnum.LOADM_PRE_STRESS_LOAD_EC
The Eurocode pre-stress load type.

Tekla.Structures.Analysis.AnalysisLoadGroup.LoadGroupTypeEnum.LOADM_LIVE_LOAD_HOUSING_EC
The Eurocode live load housing type.

Tekla.Structures.Analysis.AnalysisLoadGroup.LoadGroupTypeEnum.LOADM_LIVE_LOAD_PUBLIC_BUILDINGS_EC
The Eurocode live load public buildings type.

Tekla.Structures.Analysis.AnalysisLoadGroup.LoadGroupTypeEnum.LOADM_LIVE_LOAD_THEATRES_RESTAURANTS_EC
The Eurocode live load theatres, restaurants type.

Tekla.Structures.Analysis.AnalysisLoadGroup.LoadGroupTypeEnum.LOADM_LIVE_LOAD_WAREHOUSES_EC
The Eurocode live load warehouses type.

Tekla.Structures.Analysis.AnalysisLoadGroup.LoadGroupTypeEnum.LOADM_LIVE_LOAD_STORAGE_BUILDINGS_EC
The Eurocode live load storage buildings type.

Tekla.Structures.Analysis.AnalysisLoadGroup.LoadGroupTypeEnum.LOADM_TRAFFIC_LOAD_LIGHT_VEHICLES_EC
The Eurocode traffic load light vehicles type.

Tekla.Structures.Analysis.AnalysisLoadGroup.LoadGroupTypeEnum.LOADM_TRAFFIC_LOAD_HEAVY_VEHICLES_EC
The Eurocode traffic load heavy vehicles type.

Tekla.Structures.Analysis.AnalysisLoadGroup.LoadGroupTypeEnum.LOADM_TRAFFIC_LOAD_ROOFS_EC
The Eurocode traffic load roofs type.

Tekla.Structures.Analysis.AnalysisLoadGroup.LoadGroupTypeEnum.LOADM_SNOW_LOAD_EC
The Eurocode snow load type.

Tekla.Structures.Analysis.AnalysisLoadGroup.LoadGroupTypeEnum.LOADM_WIND_LOAD_EC
The Eurocode wind load type.

Tekla.Structures.Analysis.AnalysisLoadGroup.LoadGroupTypeEnum.LOADM_FORCES_DUE_TO_TEMPERATURE_EFFECTS_EC
The Eurocode forces due to temperature effects type.

Tekla.Structures.Analysis.AnalysisLoadGroup.LoadGroupTypeEnum.LOADM_IMPERFECTION_LOAD_DUE_TO_DEAD_LOADS_EC
The Eurocode imperfection load due to dead loads type.

Tekla.Structures.Analysis.AnalysisLoadGroup.LoadGroupTypeEnum.LOADM_IMPERFECTION_LOAD_DUE_TO_LIVE_LOADS_EC
The Eurocode imperfection load due to live loads type.

Tekla.Structures.Analysis.AnalysisLoadGroup.LoadGroupTypeEnum.LOADM_IMPERFECTION_LOAD_DUE_TO_SNOW_LOADS_EC
The Eurocode imperfection load due to snow loads type.

Tekla.Structures.Analysis.AnalysisLoadGroup.LoadGroupTypeEnum.LOADM_ACCIDENTAL_LOAD_EC
The Eurocode accidental load type.

Tekla.Structures.Analysis.AnalysisLoadGroup.LoadGroupTypeEnum.LOADM_EARTHQUAKE_LOAD_EC
The Eurocode earthquake load type.

Tekla.Structures.Analysis.AnalysisLoadGroup.LoadGroupTypeEnum.LOADM_DEAD_LOAD_ALONE_BS
The British code dead load alone type.

Tekla.Structures.Analysis.AnalysisLoadGroup.LoadGroupTypeEnum.LOADM_DEADLOAD_BS
The British code dead load type.

Tekla.Structures.Analysis.AnalysisLoadGroup.LoadGroupTypeEnum.LOADM_IMPOSED_LOAD_BS
The British code imposed load type.

Tekla.Structures.Analysis.AnalysisLoadGroup.LoadGroupTypeEnum.LOADM_WIND_LOAD_BS
The British code wind load type.

Tekla.Structures.Analysis.AnalysisLoadGroup.LoadGroupTypeEnum.LOADM_TEMPERATURE_LOAD_BS
The British code temperature load type.

Tekla.Structures.Analysis.AnalysisLoadGroup.LoadGroupTypeEnum.LOADM_VERTICAL_CRANE_LOAD_BS
The British code vertical crane load type.

Tekla.Structures.Analysis.AnalysisLoadGroup.LoadGroupTypeEnum.LOADM_HORIZONTAL_CRANE_LOAD_BS
The British code horizontal crane load type.

Tekla.Structures.Analysis.AnalysisLoadGroup.LoadGroupTypeEnum.LOADM_DEAD_LOAD_ALONE_AISC
The AISC dead load alone type.

Tekla.Structures.Analysis.AnalysisLoadGroup.LoadGroupTypeEnum.LOADM_DEAD_LOAD_AISC
The AISC dead load type.

Tekla.Structures.Analysis.AnalysisLoadGroup.LoadGroupTypeEnum.LOADM_LIVE_LOAD_AISC
The AISC live load type.

Tekla.Structures.Analysis.AnalysisLoadGroup.LoadGroupTypeEnum.LOADM_ROOF_LIVE_LOAD_AISC
The AISC roof live load type.

Tekla.Structures.Analysis.AnalysisLoadGroup.LoadGroupTypeEnum.LOADM_WIND_LOAD_AISC
The AISC wind load type.

Tekla.Structures.Analysis.AnalysisLoadGroup.LoadGroupTypeEnum.LOADM_SNOW_LOAD_AISC
The AISC snow load type.

Tekla.Structures.Analysis.AnalysisLoadGroup.LoadGroupTypeEnum.LOADM_RAINWATER_LOAD_AISC
The AISC rainwater load type.

Tekla.Structures.Analysis.AnalysisLoadGroup.LoadGroupTypeEnum.LOADM_EARTHQUAKE_LOAD_AISC
The AISC earthquake load type.

Tekla.Structures.Analysis.AnalysisLoadGroup.LoadGroupTypeEnum.LOADM_PERMANENT_LOAD_FR_CM66
The CM66 permanent load type.

Tekla.Structures.Analysis.AnalysisLoadGroup.LoadGroupTypeEnum.LOADM_EXPLOITATION_LOAD_FR_CM66
The CM66 exploitation load type.

Tekla.Structures.Analysis.AnalysisLoadGroup.LoadGroupTypeEnum.LOADM_TEMPERATURE_LOAD_FR_CM66
The CM66 temperature load type.

Tekla.Structures.Analysis.AnalysisLoadGroup.LoadGroupTypeEnum.LOADM_WIND_LOAD_FR_CM66
The CM66 wind load type.

Tekla.Structures.Analysis.AnalysisLoadGroup.LoadGroupTypeEnum.LOADM_SNOW_LOAD_FR_CM66
The CM66 snow load type.

Tekla.Structures.Analysis.AnalysisLoadGroup.LoadGroupTypeEnum.LOADM_SEISMIC_LOAD_HORIZONTAL_FR_CM66
The CM66 seismic load horizontal type.

Tekla.Structures.Analysis.AnalysisLoadGroup.LoadGroupTypeEnum.LOADM_SEISMIC_LOAD_VERTICAL_FR_CM66
The CM66 seismic load vertical type.

Tekla.Structures.Analysis.AnalysisLoadGroup.LoadGroupTypeEnum.LOADM_PERMANENT_LOAD_FR_BAEL91
The BAEL91 permanent load type.

Tekla.Structures.Analysis.AnalysisLoadGroup.LoadGroupTypeEnum.LOADM_EXPLOITATION_LOAD_FR_BAEL91
The BAEL91 exploitation load type.

Tekla.Structures.Analysis.AnalysisLoadGroup.LoadGroupTypeEnum.LOADM_TEMPERATURE_LOAD_FR_BAEL91
The BAEL91 temperature load type.

Tekla.Structures.Analysis.AnalysisLoadGroup.LoadGroupTypeEnum.LOADM_WIND_LOAD_FR_BAEL91
The BAEL91 wind load type.

Tekla.Structures.Analysis.AnalysisLoadGroup.LoadGroupTypeEnum.LOADM_SNOW_LOAD_FR_BAEL91
The BAEL91 snow load type.

Tekla.Structures.Analysis.AnalysisLoadGroup.LoadGroupTypeEnum.LOADM_SEISMIC_LOAD_FR_BAEL91
The BAEL91 seismic load type.

Tekla.Structures.Analysis.AnalysisLoadGroup.LoadGroupTypeEnum.LOADM_ACCIDENTAL_LOAD_FR_BAEL91
The BAEL91 accidental load type.

Tekla.Structures.Analysis.AnalysisLoadGroup.LoadGroupTypeEnum.LOADM_DEAD_LOAD_UBC
The UBC dead load type.

Tekla.Structures.Analysis.AnalysisLoadGroup.LoadGroupTypeEnum.LOADM_LIVE_LOAD_UBC
The UBC live load type.

Tekla.Structures.Analysis.AnalysisLoadGroup.LoadGroupTypeEnum.LOADM_ROOF_LIVE_LOAD_UBC
The UBC roof live load type.

Tekla.Structures.Analysis.AnalysisLoadGroup.LoadGroupTypeEnum.LOADM_WIND_LOAD_UBC
The UBC wind load type.

Tekla.Structures.Analysis.AnalysisLoadGroup.LoadGroupTypeEnum.LOADM_SNOW_LOAD_UBC
The UBC snow load type.

Tekla.Structures.Analysis.AnalysisLoadGroup.LoadGroupTypeEnum.LOADM_TEMPERATURE_LOAD_UBC
The UBC temperature load type.

Tekla.Structures.Analysis.AnalysisLoadGroup.LoadGroupTypeEnum.LOADM_FLUIDS_LOAD_UBC
The UBC fluids load type.

Tekla.Structures.Analysis.AnalysisLoadGroup.LoadGroupTypeEnum.LOADM_SOIL_LOAD_UBC
The UBC soil load type.

Tekla.Structures.Analysis.AnalysisLoadGroup.LoadGroupTypeEnum.LOADM_PONDING_LOAD_UBC
The UBC ponding load type.

Tekla.Structures.Analysis.AnalysisLoadGroup.LoadGroupTypeEnum.LOADM_SEISMIC_LOAD_UBC
The UBC seismic load type.

Tekla.Structures.Analysis.AnalysisLoadGroup.LoadGroupTypeEnum.LOADM_DEAD_LOAD_IBC
The IBC dead load type.

Tekla.Structures.Analysis.AnalysisLoadGroup.LoadGroupTypeEnum.LOADM_LIVE_LOAD_IBC
The IBC live load type.

Tekla.Structures.Analysis.AnalysisLoadGroup.LoadGroupTypeEnum.LOADM_ROOF_LIVE_LOAD_IBC
The IBC roof live load type.

Tekla.Structures.Analysis.AnalysisLoadGroup.LoadGroupTypeEnum.LOADM_WIND_LOAD_IBC
The IBC wind load type.

Tekla.Structures.Analysis.AnalysisLoadGroup.LoadGroupTypeEnum.LOADM_SNOW_LOAD_IBC
The IBC snow load type.

Tekla.Structures.Analysis.AnalysisLoadGroup.LoadGroupTypeEnum.LOADM_TEMPERATURE_LOAD_IBC
The IBC temperature load type.

Tekla.Structures.Analysis.AnalysisLoadGroup.LoadGroupTypeEnum.LOADM_FLUIDS_LOAD_IBC
The IBC fluids load type.

Tekla.Structures.Analysis.AnalysisLoadGroup.LoadGroupTypeEnum.LOADM_SOIL_LOAD_IBC
The IBC soil load type.

Tekla.Structures.Analysis.AnalysisLoadGroup.LoadGroupTypeEnum.LOADM_RAIN_LOAD_IBC
The IBC rain load type.

Tekla.Structures.Analysis.AnalysisLoadGroup.LoadGroupTypeEnum.LOADM_PONDING_LOAD_IBC
The IBC ponding load type.

Tekla.Structures.Analysis.AnalysisLoadGroup.LoadGroupTypeEnum.LOADM_SEISMIC_LOAD_IBC
The IBC seismic load type.

Tekla.Structures.Analysis.AnalysisLoadGroup.LoadGroupTypeEnum.LOADM_DEAD_LOAD_ACI
The ACI dead load type.

Tekla.Structures.Analysis.AnalysisLoadGroup.LoadGroupTypeEnum.LOADM_LIVE_LOAD_ACI
The ACI live load type.

Tekla.Structures.Analysis.AnalysisLoadGroup.LoadGroupTypeEnum.LOADM_ROOF_LIVE_LOAD_ACI
The ACI roof live load type.

Tekla.Structures.Analysis.AnalysisLoadGroup.LoadGroupTypeEnum.LOADM_WIND_LOAD_ACI
The ACI wind load type.

Tekla.Structures.Analysis.AnalysisLoadGroup.LoadGroupTypeEnum.LOADM_SEISMIC_LOAD_ACI
The ACI seismic load type.

Tekla.Structures.Analysis.AnalysisLoadGroup.LoadGroupTypeEnum.LOADM_SNOW_LOAD_ACI
The ACI snow load type.

Tekla.Structures.Analysis.AnalysisLoadGroup.LoadGroupTypeEnum.LOADM_FLUIDS_LOAD_ACI
The ACI fluids load type.

Tekla.Structures.Analysis.AnalysisLoadGroup.LoadGroupTypeEnum.LOADM_SOIL_LOAD_ACI
The ACI soil load type.

Tekla.Structures.Analysis.AnalysisLoadGroup.LoadGroupTypeEnum.LOADM_RAIN_LOAD_ACI
The ACI rain load type.

Tekla.Structures.Analysis.AnalysisLoadGroup.LoadGroupTypeEnum.LOADM_TEMPERATURE_LOAD_ACI
The ACI temperature load type.